using System.ComponentModel;

namespace loader_5_0_lib.Enums
{
    public enum RefErrorCommonType
    {
        /// <summary>
        /// 01 Несоответствие единому техническому формату (AcceptanceError)
        /// </summary>
        [Description("01 Несоответствие единому техническому формату")]
        ac01 = 1,

        /// <summary>
        /// 02 Несоответствие техническим требованиям к формированию показателей кредитной информации (AcceptanceError)
        /// </summary>
        [Description("02 Несоответствие техническим требованиям к формированию показателей кредитной информации")]
        ac02 = 2,

        /// <summary>
        /// 03 Несоответствие сведений информации, полученной ранее и хранящейся в бюро кредитных историй (AcceptanceError)
        /// </summary>
        [Description("03 Несоответствие сведений информации, полученной ранее и хранящейся в бюро кредитных историй")]
        ac03 = 3,

        /// <summary>
        /// 04 Сведения в отношении субъекта кредитной истории отвечают признакам недостоверности (AcceptanceError)
        /// </summary>
        [Description("04 Сведения в отношении субъекта кредитной истории отвечают признакам недостоверности")]
        ac04 = 4,

        /// <summary>
        /// 01 Некорректное (неверное) наименование файла (ReceiptError)
        /// </summary>
        [Description("Некорректное (неверное) наименование файла")]
        rc01 = 5,

        /// <summary>
        /// 02 Некорректные (неверные) регистрационные данные файла (ReceiptError)
        /// </summary>
        [Description("Некорректные (неверные) регистрационные данные файла")]
        rc02 = 6,

        /// <summary>
        /// 03 Некорректные (неверные) идентификационные данные, полученные от источника (ReceiptError)
        /// </summary>
        [Description("Некорректные (неверные) идентификационные данные, полученные от источника")]
        rc03 = 7,

        /// <summary>
        /// 04 Ошибка архивации файла (ReceiptError)
        /// </summary>
        [Description("Ошибка архивации файла")]
        rc04 = 8,

        /// <summary>
        /// 05 Ошибка подписи/сертификата/шифрования (ReceiptError)
        /// </summary>
        [Description("Ошибка подписи/сертификата/шифрования")]
        rc05 = 9,

        /// <summary>
        /// 06 Отсутствие доступа источника к системе загрузки файлов (ReceiptError)
        /// </summary>
        [Description("Указанный сертификат не найден в системе Бюро. Обратитесь к администратору Бюро")]
        rc06 = 10,

        /// <summary>
        /// 07 Ошибка в схеме 
        /// </summary>
        [Description("Ошибка в схеме")]
        rc07 = 11,

        /// <summary>
        /// 99 Иная ошибка, не предусмотренная данной таблицей. В описании ошибки должна быть дополнительно описана причина ее возникновения (ReceiptError)
        /// </summary>
        [Description("Иная ошибка, не предусмотренная данной таблицей. В описании ошибки должна быть дополнительно описана причина ее возникновения")]
        rc99 = 99
    }
}
